Courses/7140/Lectures/Overview/Epilogue/state-of-SE.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The State of Software Engineering</title>
<!-- 2018-10-29 Mon 00:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">The State of Software Engineering</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Opinions on Software Quality</a></li>
<li><a href="#sec-2">2. Software Engineering</a></li>
<li><a href="#sec-3">3. Software "Science"</a></li>
<li><a href="#sec-4">4. Software "Engineering"</a></li>
<li><a href="#sec-5">5. Best Practices</a></li>
</ul>
</div>
</div>
<p>
Do you know of any bug-free program?  What is its length?
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Opinions on Software Quality</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Hoare on Software Quality,
<a href="http://onlinelibrary.wiley.com/doi/10.1002/spe.4380020202/epdf">http://onlinelibrary.wiley.com/doi/10.1002/spe.4380020202/epdf</a>,
Software &#x2013; Practice and Experience, 103-105, 1972.
</li>

<li>A Few Opinions of Professor <a href="./hehner.html">Hehner</a>
</li>

<li>Bill Gates, RSA Conference, 2005: "64% of developers are not
confident in their ability to write secure applications."
</li>

<li>Bruce Schneier: "We wouldn't have to spend so much time and effort
on network security if we didn't have such bad software security."
&#x2013; Bruce Schneier, author of "Applied Cryptography", and "Secrets &amp;
Lies: Digital Security in a Networked World".
</li>

<li>"Malicious hackers don't create security holes; they simply
exploit them.  Security holes and vulnerabilities &#x2013; the real root
cause of the problem &#x2013; are the result of bad software design and
implementation."  &#x2013; John Viega &amp; Gary McGraw, authors of
Building Secure Software, 2001.
</li>

<li>"Have you ever written a program section with a security hole?
How did you know?" &#x2013; Mark G. Graff &amp; Kenneth R. van Wyk, authors of
"Secure Coding: Principles and Practices"
</li>

<li>"There is no software liability &#x2013; no incentive for secure software.
Most developers never learned to produce secure code.  Secure code
often takes a performance hit &#x2013; i.e., the software runs about 1/3
slower &#x2013; something many users don't want to tolerate.  Writing
secure code also takes a lot more time &#x2013; hence, development costs
are higher than usual.  Consequently, the longer development times
and the longer running times discourage developers from writing
secure code."
</li>

<li><a href="http://www.gnu.org/philosophy/shouldbefree.html">www.gnu.org/philosophy/ shouldbefree.html</a> Opinion
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Software Engineering</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Software Engineering "culture" at leading companies: Sustained on
the large scale. Thousands of engineers conforming to style guides,
documenting specs and designs, writing unit, regression and
integration tests.
</li>

<li>"Bad programmers dive right in and start coding. Good programmers
wrestle with a problem, thinking of different ways of looking at
it, trying to come up with a breakdown of the components of the
solution, and considering a variety of approaches before they can
write any code at all."
</li>

<li>"Featurism", Performance: Overriding concern, Correctness: some
concern, Security: ??, Privacy: ??
</li>

<li>Secure software development is to prevent software crash/ hang/
misbehave &#x2013; any concern??
</li>

<li>Typically, 5 - 50 bugs per KLOC ?  Suppose 10% of the bugs result
in security faults.  40,000 KLOC*5*10% = 25,000 security bugs.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Software "Science"</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Like physics is to engineering &#x2026;
</li>
<li><a href="./metrics.html">Software Metrics</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Software "Engineering"</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Life cycle <a href="../Cartoon/7140-life-cycle-cartoon.html">cartoon</a>
</li>

<li>Is software engineering "engineering"?  Can we defend the title,
"Software Engineering"?
</li>

<li>Civil Engineering can do cost-estimates, excellent long before a
project begins.  Upon completion, these can be seen to have been
valid (but for inflation, political turmoil, etc.)
<ol class="org-ol">
<li>Can software "engineering" do that?
</li>
</ol>
</li>

<li>Meaning of "Software Maintenance"
<ol class="org-ol">
<li>Software Smells
</li>
<li>Refactoring
</li>
<li>Maintenance v Enhancement
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Best Practices</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="../BestPractices">../BestPractices</a>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-04-28
</div>
</body>
</html>
